Revit 2020 API
View.CanCategoryBeHidden Method
 Checks whether the category can be hidden in the view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 20.0.0.0 (20.0.0.377)
Since: 2014
Syntax
C#
public bool CanCategoryBeHidden(
	ElementId elementId
)
Visual Basic
Public Function CanCategoryBeHidden ( _
	elementId As ElementId _
) As Boolean
Visual C++
public:
bool CanCategoryBeHidden(
	ElementId^ elementId
)
Parameters
elementId
Type: Autodesk.Revit.DB.ElementId
 ElementId of the category.
Return Value
 True if the category can be hidden, false otherwise.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was NULL
See Also
View Class
Autodesk.Revit.DB Namespace